analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.h
/******************************************************************************
 * Copyright (C) 2022 Maxim Integrated Products, Inc., All rights Reserved.
 * 
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_MAX32570_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_MAX32570_H_

#ifndef TARGET_NUM
#define TARGET_NUM 32570
#endif

#define MXC_NUMCORES 1

#include <stdint.h>
#include <stdbool.h>

#ifndef FALSE
#define FALSE (0)
#endif

#ifndef TRUE
#define TRUE (1)
#endif

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined(__GNUC__)
#define __weak __attribute__((weak))

#elif defined(__CC_ARM)

#define inline __inline
#pragma anon_unions

#endif

typedef enum {
#if !(defined(__riscv0) || defined(__riscv1)) // not RISC-V
    NonMaskableInt_IRQn = -14,
    HardFault_IRQn = -13,
    MemoryManagement_IRQn = -12,
    BusFault_IRQn = -11,
    UsageFault_IRQn = -10,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,

    /* Device-specific interrupt sources (external to ARM core)                 */
    /*                      table entry number                                  */
    /*                      ||||                                                */
    /*                      ||||  table offset address                          */
    /*                      vvvv  vvvvvv                                        */

    PF_IRQn = 0, /* 0x10  0x0040  16: Power Fail */
    WDT0_IRQn, /* 0x11  0x0044  17: Watchdog 0 */
    USB_IRQn, /* 0x12  0x0048  18: USB */
    RTC_IRQn, /* 0x13  0x004C  19: RTC */
    TRNG_IRQn, /* 0x14  0x0050  20: True Random Number Generator */
    TMR0_IRQn, /* 0x15  0x0054  21: Timer 0 */
    TMR1_IRQn, /* 0x16  0x0058  22: Timer 1 */
    TMR2_IRQn, /* 0x17  0x005C  23: Timer 2 */
    TMR3_IRQn, /* 0x18  0x0060  24: Timer 3*/
    TMR4_IRQn, /* 0x19  0x0064  25: Timer 4*/
    TMR5_IRQn, /* 0x1A  0x0068  26: Timer 5 */
    SC0_IRQn, /* 0x1B  0x006C  27: Smart Card 0 */
    LCD_IRQn, /* 0x1C  0x0070  28: LCD Controller*/
    I2C0_IRQn, /* 0x1D  0x0074  29: I2C0 */
    UART0_IRQn, /* 0x1E  0x0078  30: UART 0 */
    UART1_IRQn, /* 0x1F  0x007C  31: UART 1 */
    SPI0_IRQn, /* 0x20  0x0080  32: SPI0 */
    SPI1_IRQn, /* 0x21  0x0084  33: SPI1 */
    SPI2_IRQn, /* 0x22  0x0088  34: SPI2 */
    SKB_IRQn, /* 0x23  0x008C  35: Secure Keypad */
    ADC_IRQn, /* 0x24  0x0090  36: ADC */
    RSV21_IRQn, /* 0x25  0x0094  37: Reserved */
    MSR_IRQn, /* 0x26  0x0098  38: Magstripe DSP */
    FLC0_IRQn, /* 0x27  0x009C  39: Flash Controller 0 */
    GPIO0_IRQn, /* 0x28  0x00A0  40: GPIO0 */
    GPIO1_IRQn, /* 0x29  0x00A4  41: GPIO1 */
    GPIO2_IRQn, /* 0x2A  0x00A8  42: GPIO2 */
    CRYPTO_IRQn, /* 0x2B  0x00AC  43: Crypto */
    DMA0_IRQn, /* 0x2C  0x00B0  44: DMA0 */
    DMA1_IRQn, /* 0x2D  0x00B4  45: DMA1 */
    DMA2_IRQn, /* 0x2E  0x00B8  46: DMA2 */
    DMA3_IRQn, /* 0x2F  0x00BC  47: DMA3 */
    TMR6_IRQn, /* 0x30  0x00C0  48: Timer 6 */
    TMR7_IRQn, /* 0x31  0x00C4  49: Timer 7 */
    UART2_IRQn, /* 0x32  0x00C8  50: UART 2 */
    NFC_IRQn, /* 0x33  0x00CC  51: NFC Link Control */
    I2C1_IRQn, /* 0x34  0x00D0  52: I2C1 */
    SC1_IRQn, /* 0x35  0x00D4  53: Smart Card 1 */
    SPIXFC_IRQn, /* 0x36  0x00D8  54: SPI execute in place */
    RSV39_IRQn, /* 0x37  0x00DC  55: Reserved */
    RSV40_IRQn, /* 0x38  0x00E0  56: Reserved */
    RSV41_IRQn, /* 0x39  0x00E4  57: Reserved */
    RSV42_IRQn, /* 0x3A  0x00E8  58: Reserved */
    RSV43_IRQn, /* 0x3B  0x00EC  59: Reserved */
    RSV44_IRQn, /* 0x3C  0x00F0  60: Reserved */
    RSV45_IRQn, /* 0x3D  0x00F4  61: Reserved */
    RSV46_IRQn, /* 0x3E  0x00F8  62: Reserved */
    RSV47_IRQn, /* 0x3F  0x00FC  63: Reserved */
    RSV48_IRQn, /* 0x40  0x0100  64: Reserved */
    RSV49_IRQn, /* 0x41  0x0104  65: Reserved */
    RSV50_IRQn, /* 0x42  0x0108  66: Reserved */
    RSV51_IRQn, /* 0x43  0x010C  67: Reserved */
    RSV52_IRQn, /* 0x44  0x0110  68: Reserved */
    RSV53_IRQn, /* 0x45  0x0114  69: Reserved */
    GPIOWAKE_IRQn, /* 0x46  0x0118  70: GPIO Wakeup */
    NFCWAKE_IRQn, /* 0x47  0x011C  71: NFC Wakeup */
    SPI3_IRQn, /* 0x48  0x0120  72: SPI3 */
    WDT1_IRQn, /* 0x49  0x0124  73: Watchdog 1 */
    GPIO3_IRQn, /* 0x4A  0x0128  74: GPIO3 */
    PT_IRQn, /* 0x4B  0x012C  75: Pulse train */
    RISCV1_IRQn, /* 0x4C  0x0130  76: RISCV 1 */
    RSV61_IRQn, /* 0x4D  0x0134  77: Reserved */
    I2C2_IRQn, /* 0x4E  0x0138  78: I2C 2 */
    RISCV0_IRQn, /* 0x4F  0x013C  79: RISCV 0 */
    EMAC_IRQn, /* 0x50  0x0140  80: Ethernet MAC */
    RSV65_IRQn, /* 0x51  0x0144  81: Reserved */
    SDHC_IRQn, /* 0x52  0x0148  82: SDIO/SDHC */
    OWM_IRQn, /* 0x53  0x014C  83: One Wire Master */
    DMA4_IRQn, /* 0x54  0x0150  84: DMA4 */
    DMA5_IRQn, /* 0x55  0x0154  85: DMA5 */
    DMA6_IRQn, /* 0x56  0x0158  86: DMA6 */
    DMA7_IRQn, /* 0x57  0x015C  87: DMA7 */
    DMA8_IRQn, /* 0x58  0x0160  88: DMA8 */
    DMA9_IRQn, /* 0x59  0x0164  89: DMA9 */
    DMA10_IRQn, /* 0x5A  0x0168  90: DMA10 */
    DMA11_IRQn, /* 0x5B  0x016C  91: DMA11 */
    DMA12_IRQn, /* 0x5C  0x0170  92: DMA12 */
    DMA13_IRQn, /* 0x5D  0x0174  93: DMA13 */
    DMA14_IRQn, /* 0x5E  0x0178  94: DMA14 */
    DMA15_IRQn, /* 0x5F  0x017C  95: DMA15 */
    USBDMA_IRQn, /* 0x60  0x0180  96: USB DMA */
    RSV81_IRQn, /* 0x61  0x0184  97: Reserved */
    ECC_IRQn, /* 0x62  0x0188  98: Error Correction */
    RSV83_IRQn, /* 0x63  0x018C  99: Reserved */
    RSV84_IRQn, /* 0x64  0x0190  100: Reserved */
    SCA_IRQn, /* 0x65  0x0194  101: SCA */
    RSV86_IRQn, /* 0x66  0x0198  102: Reserved */
    FLC1_IRQn, /* 0x67  0x019C  103: Flash Control 1 */
    UART3_IRQn, /* 0x68  0x01A0  104: UART 3 */
    UART4_IRQn, /* 0x69  0x01A4  105: UART 4 */
    UART5_IRQn, /* 0x6A  0x01A8  106: UART 5 */
    CAMERAIF_IRQn, /* 0x6B  0x01AC  107: Camera IF */
    RSV92_IRQn, /* 0x6C  0x01B0  108: Reserved */
    HTMR0_IRQn, /* 0x6D  0x01B4  109: HTimer0 */
    HTMR1_IRQn, /* 0x6E  0x01B8  110: HTimer1 */
    RSV95_IRQn, /* 0x6F  0x01BC  111: Reserved */
    RSV96_IRQn, /* 0x70  0x01C0  112: Reserved */
    RSV97_IRQn, /* 0x71  0x01C4  113: Reserved */
    RSV98_IRQn, /* 0x72  0x01C8  114: Reserved */
    I2S_IRQn, /* 0x72  0x01CC  115: I2S */
#else // RISCV
#ifdef __riscv0
    HardFault_IRQn = 3, /* 0x03,3 HardFault */
    CM4_IRQn = 4, /* 0x04,4 from CM4 */
    RSV5_IRQn, /* 0x05,5 Reserved */
    RISCV1_IRQn, /* 0x06,6 from RISCV1 */
    WDT0_IRQn, /* 0x07,7 Watchdog Timer 0 */
    WDT1_IRQn, /* 0x08,8 Watchdog Timer 1 */
    RTC_IRQn, /* 0x09,9 RTC */
    MSRADC_IRQn, /* 0x0A,10 MSR ADC */
    NFC_IRQn, /* 0x0B,11 NFC */
    TMR0_IRQn, /* 0x0C,12 Timer 0 */
    TMR1_IRQn, /* 0x0D,13 Timer 1 */
    TMR2_IRQn, /* 0x0E,14 Timer 2 */
    TMR3_IRQn, /* 0x0F,15 Timer 3 */
    TMR4_IRQn, /* 0x10,16 Timer 4 */
    TMR5_IRQn, /* 0x11,17 Timer 5 */
    TMR6_IRQn, /* 0x12,18 Timer 6 */
    TMR7_IRQn, /* 0x13,19 Timer 7 */
    GPIO0_IRQn, /* 0x14,20 GPIO0 */
    GPIO1_IRQn, /* 0x15,21 GPIO1 */
    GPIO2_IRQn, /* 0x16,22 GPIO2 */
    GPIO3_IRQn, /* 0x17,23 GPIO3 */
    I2C0_IRQn, /* 0x18,24 I2C0 */
    SPI0_IRQn, /* 0x19,25 SPI0 */
    UART0_IRQn, /* 0x1A,26 UART0 */
    I2C1_IRQn, /* 0x1B,27 I2C1 */
    SPI1_IRQn, /* 0x1C,28 SPI1 */
    UART1_IRQn, /* 0x1D,29 UART1 */
    I2C2_IRQn, /* 0x1E,30 I2C2 */
    SPI2_IRQn, /* 0x1F,31 SPI2 */
    UART2_IRQn, /* 0x20,32 UART2 */
    SPI3_IRQn, /* 0x21,33 SPI3 */
    UART3_IRQn, /* 0x22,34 UART3 */
    UART4_IRQn, /* 0x23,35 UART4 */
    UART5_IRQn, /* 0x24,36 UART5 */
    OWM_IRQn, /* 0x25,37 OWM */
    TRNG_IRQn, /* 0x26,38 TRNG */
    CRYPTO_IRQn, /* 0x27,39 Crypto Engine */
    SCA_IRQn, /* 0x28,40 SCA Crypto Accelerator */
    SC0_IRQn, /* 0x29,41 SC0 */
    SC1_IRQn, /* 0x2A,42 SC1 */
    SKBD_IRQn, /* 0x2B,43 Secure Keyboard */
    ADC_IRQn, /* 0x2C,44 ADC */
    PT_IRQn, /* 0x2D,45 Pulse Train */
    EMAC_IRQn, /* 0x2E,46 Ethernet MAC */
    SDHC_IRQn, /* 0x2F,47 SDHC */
    CAMERAIF_IRQn, /* 0x30,48 Camera IF */
    TFT_IRQn, /* 0x31,49 TFT Display Controller */
    HTMR0_IRQn, /* 0x32,50 HTimer 0 */
    HTMR1_IRQn, /* 0x33,51 HTimer 1 */
    SPIXIP_IRQn, /* 0x34,52 SPI XIP */
    FLC0_IRQn, /* 0x35,53 FLC0 */
    FLC1_IRQn, /* 0x36,54 FLC1 */
    DMA0_IRQn, /* 0x37,55 DMA0 */
    DMA1_IRQn, /* 0x38,56 DMA1 */
    DMA2_IRQn, /* 0x39,57 DMA2 */
    DMA3_IRQn, /* 0x3A,58 DMA3 */
    DMA4_IRQn, /* 0x3B,59 DMA4 */
    DMA5_IRQn, /* 0x3C,60 DMA5 */
    DMA6_IRQn, /* 0x3D,61 DMA6 */
    DMA7_IRQn, /* 0x3E,62 DMA7 */
    DMA8_15_IRQn, /* 0x3F,63 DMA(8-15) */
#else // __riscv1
    HardFault_IRQn = 3, /* 0x03,3 HardFault */
    CM4_IRQn = 4, /* 0x04,4 from CM4 */
    RISCV0_IRQn, /* 0x05,5 from RISCV0 */
    RSV6_IRQn, /* 0x06,6 Reserved */
    WDT0_IRQn, /* 0x07,7 Watchdog Timer 0 */
    WDT1_IRQn, /* 0x08,8 Watchdog Timer 1 */
    RTC_IRQn, /* 0x09,9 RTC */
    MSRADC_IRQn, /* 0x0A,10 MSR ADC */
    NFC_IRQn, /* 0x0B,11 NFC */
    TMR0_IRQn, /* 0x0C,12 Timer 0 */
    TMR1_IRQn, /* 0x0D,13 Timer 1 */
    TMR2_IRQn, /* 0x0E,14 Timer 2 */
    TMR3_IRQn, /* 0x0F,15 Timer 3 */
    TMR4_IRQn, /* 0x10,16 Timer 4 */
    TMR5_IRQn, /* 0x11,17 Timer 5 */
    TMR6_IRQn, /* 0x12,18 Timer 6 */
    TMR7_IRQn, /* 0x13,19 Timer 7 */
    GPIO0_IRQn, /* 0x14,20 GPIO0 */
    GPIO1_IRQn, /* 0x15,21 GPIO1 */
    GPIO2_IRQn, /* 0x16,22 GPIO2 */
    GPIO3_IRQn, /* 0x17,23 GPIO3 */
    I2C0_IRQn, /* 0x18,24 I2C0 */
    SPI0_IRQn, /* 0x19,25 SPI0 */
    UART0_IRQn, /* 0x1A,26 UART0 */
    I2C1_IRQn, /* 0x1B,27 I2C1 */
    SPI1_IRQn, /* 0x1C,28 SPI1 */
    UART1_IRQn, /* 0x1D,29 UART1 */
    I2C2_IRQn, /* 0x1E,30 I2C2 */
    SPI2_IRQn, /* 0x1F,31 SPI2 */
    UART2_IRQn, /* 0x20,32 UART2 */
    SPI3_IRQn, /* 0x21,33 SPI3 */
    UART3_IRQn, /* 0x22,34 UART3 */
    UART4_IRQn, /* 0x23,35 UART4 */
    UART5_IRQn, /* 0x24,36 UART5 */
    OWM_IRQn, /* 0x25,37 OWM */
    TRNG_IRQn, /* 0x26,38 TRNG */
    CRYPTO_IRQn, /* 0x27,39 Crypto Engine */
    SCA_IRQn, /* 0x28,40 SCA Crypto Accelerator */
    SC0_IRQn, /* 0x29,41 SC0 */
    SC1_IRQn, /* 0x2A,42 SC1 */
    SKBD_IRQn, /* 0x2B,43 Secure Keyboard */
    ADC_IRQn, /* 0x2C,44 ADC */
    PT_IRQn, /* 0x2D,45 Pulse Train */
    EMAC_IRQn, /* 0x2E,46 Ethernet MAC */
    SDHC_IRQn, /* 0x2F,47 SDHC */
    CAMERAIF_IRQn, /* 0x30,48 Camera IF */
    TFT_IRQn, /* 0x31,49 TFT Display Controller */
    HTMR0_IRQn, /* 0x32,50 HTimer 0 */
    HTMR1_IRQn, /* 0x33,51 HTimer 1 */
    SPIXIP_IRQn, /* 0x34,52 SPI XIP */
    FLC0_IRQn, /* 0x35,53 FLC0 */
    FLC1_IRQn, /* 0x36,54 FLC1 */
    DMA0_IRQn, /* 0x37,55 DMA0 */
    DMA1_IRQn, /* 0x38,56 DMA1 */
    DMA2_IRQn, /* 0x39,57 DMA2 */
    DMA3_IRQn, /* 0x3A,58 DMA3 */
    DMA4_IRQn, /* 0x3B,59 DMA4 */
    DMA5_IRQn, /* 0x3C,60 DMA5 */
    DMA6_IRQn, /* 0x3D,61 DMA6 */
    DMA7_IRQn, /* 0x3E,62 DMA7 */
    DMA8_15_IRQn, /* 0x3F,63 DMA(8-15) */
#endif
#endif // __riscv
    MXC_IRQ_EXT_COUNT
} IRQn_Type;

