analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.h
#define MXC_SC_GET_IRQ(i) (IRQn_Type)((i) == 0 ? SC0_IRQn : (i) == 1 ? SC1_IRQn : 0)

#define MXC_SC_GET_BASE(i) ((i) == 0 ? MXC_BASE_SC0 : (i) == 1 ? MXC_BASE_SC1 : 0)

#define MXC_SC_GET_IDX(p) ((p) == MXC_SC0 ? 0 : (p) == MXC_SC1 ? 1 : -1)

/******************************************************************************/
/*                                                      Instruction Cache XIP */
#define MXC_BASE_SFCC ((uint32_t)0x4002F000UL)
#define MXC_SFCC ((mxc_icc_regs_t *)MXC_BASE_SFCC)

/******************************************************************************/
/*                                                                        CLCD */
#define MXC_BASE_CLCD ((uint32_t)0x40031000UL)
#define MXC_CLCD ((mxc_clcd_regs_t *)MXC_BASE_CLCD)

/******************************************************************************/
/*                                                            Secure Keyboard */
#define MXC_BASE_SKBD ((uint32_t)0x40032000UL)
#define MXC_SKBD ((mxc_skbd_regs_t *)MXC_BASE_SKBD)

/******************************************************************************/
/*                                                            SPIX Data Cache */
#define MXC_BASE_SRCC ((uint32_t)0x40033000UL)
#define MXC_SRCC ((mxc_srcc_regs_t *)MXC_BASE_SRCC)

/******************************************************************************/
/*                                                                        ADC */
#define MXC_BASE_ADC ((uint32_t)0x40034000UL)
#define MXC_ADC ((mxc_adc_regs_t *)MXC_BASE_ADC)
#define MXC_ADC_MAX_CLOCK 8000000 // Maximum ADC clock in Hz

/******************************************************************************/
/*                                                     XXX Actually reserved! */
#define MXC_BASE_RESERVED ((uint32_t)0x40035000UL)

/******************************************************************************/
/*                                                                  Smart DMA */
#define MXC_BASE_SDMA0 ((uint32_t)0x40036000UL)
#define MXC_SDMA0 ((mxc_sdma_regs_t *)MXC_BASE_SDMA0)
#define MXC_BASE_SDMA1 ((uint32_t)0x4004B000UL)
#define MXC_SDMA1 ((mxc_sdma_regs_t *)MXC_BASE_SDMA1)

/******************************************************************************/
/*                                                               SPI XIP Data */
#define MXC_BASE_SPIXR ((uint32_t)0x4003A000UL)
#define MXC_SPIXR ((mxc_spixr_regs_t *)MXC_BASE_SPIXR)

// TODO(2-7-2023): Verify register file for MIPI DSI.
// /******************************************************************************/
//                                                                    MIPI DSI 
// #define MXC_BASE_DSI ((uint32_t)0x4003B000UL)
// #define MXC_DSI ((mxc_dsi_regs_t *)MXC_BASE_DSI)

/*******************************************************************************/
/*                                                      Pulse Train Generation */
#define MXC_CFG_PT_INSTANCES (8)

#define MXC_BASE_PTG ((uint32_t)0x4003C000UL)
#define MXC_PTG ((mxc_ptg_regs_t *)MXC_BASE_PTG)
#define MXC_BASE_PT0 ((uint32_t)0x4003C020UL)
#define MXC_PT0 ((mxc_pt_regs_t *)MXC_BASE_PT0)
#define MXC_BASE_PT1 ((uint32_t)0x4003C040UL)
#define MXC_PT1 ((mxc_pt_regs_t *)MXC_BASE_PT1)
#define MXC_BASE_PT2 ((uint32_t)0x4003C060UL)
#define MXC_PT2 ((mxc_pt_regs_t *)MXC_BASE_PT2)
#define MXC_BASE_PT3 ((uint32_t)0x4003C080UL)
#define MXC_PT3 ((mxc_pt_regs_t *)MXC_BASE_PT3)
#define MXC_BASE_PT4 ((uint32_t)0x4003C0A0UL)
#define MXC_PT4 ((mxc_pt_regs_t *)MXC_BASE_PT4)
#define MXC_BASE_PT5 ((uint32_t)0x4003C0C0UL)
#define MXC_PT5 ((mxc_pt_regs_t *)MXC_BASE_PT5)
#define MXC_BASE_PT6 ((uint32_t)0x4003C0E0UL)
#define MXC_PT6 ((mxc_pt_regs_t *)MXC_BASE_PT6)
#define MXC_BASE_PT7 ((uint32_t)0x4003C100UL)
#define MXC_PT7 ((mxc_pt_regs_t *)MXC_BASE_PT7)

#define MXC_PT_GET_BASE(i)     \
    ((i) == 0 ? MXC_BASE_PT0 : \
     (i) == 1 ? MXC_BASE_PT1 : \
     (i) == 2 ? MXC_BASE_PT2 : \
     (i) == 3 ? MXC_BASE_PT3 : \
     (i) == 4 ? MXC_BASE_PT4 : \
     (i) == 5 ? MXC_BASE_PT5 : \
     (i) == 6 ? MXC_BASE_PT6 : \
     (i) == 7 ? MXC_BASE_PT7 : \
                0)

#define MXC_PT_GET_PT(i)  \
    ((i) == 0 ? MXC_PT0 : \
     (i) == 1 ? MXC_PT1 : \
     (i) == 2 ? MXC_PT2 : \
     (i) == 3 ? MXC_PT3 : \
     (i) == 4 ? MXC_PT4 : \
     (i) == 5 ? MXC_PT5 : \
     (i) == 6 ? MXC_PT6 : \
     (i) == 7 ? MXC_PT7 : \
                0)

#define MXC_PT_GET_IDX(p) \
    ((p) == MXC_PT0 ? 0 : \
     (p) == MXC_PT1 ? 1 : \
     (p) == MXC_PT2 ? 2 : \
     (p) == MXC_PT3 ? 3 : \
     (p) == MXC_PT4 ? 4 : \
     (p) == MXC_PT5 ? 5 : \
     (p) == MXC_PT6 ? 6 : \
     (p) == MXC_PT7 ? 7 : \
                      -1)

/******************************************************************************/
/*                                                            One Wire Master */
#define MXC_BASE_OWM ((uint32_t)0x4003D000UL)
#define MXC_OWM ((mxc_owm_regs_t *)MXC_BASE_OWM)

/******************************************************************************/
/*                                                                  Semaphore */
#define MXC_CFG_SEMA_INSTANCES (8)

#define MXC_BASE_SEMA ((uint32_t)0x4003E000UL)
#define MXC_SEMA ((mxc_sema_regs_t *)MXC_BASE_SEMA)

/******************************************************************************/
/*                                                      Pixel Bit Manipulator */
#define MXC_BASE_PBM ((uint32_t)0x4003F000UL)
#define MXC_PBM ((mxc_pbm_regs_t *)MXC_BASE_PBM)

/******************************************************************************/
/*                                                         Contactless RF NFC */
#define MXC_BASE_NFC ((uint32_t)0x40240000UL)
#define MXC_NFC ((mxc_nfc_regs_t *)MXC_BASE_NFC)

/******************************************************************************/
/*                                               UART / Serial Port Interface */
#define MXC_UART_INSTANCES (6)
#define MXC_UART_FIFO_DEPTH (8)

#define MXC_BASE_UART0 ((uint32_t)0x40042000UL)
#define MXC_UART0 ((mxc_uart_regs_t *)MXC_BASE_UART0)
#define MXC_BASE_UART1 ((uint32_t)0x40043000UL)
#define MXC_UART1 ((mxc_uart_regs_t *)MXC_BASE_UART1)
#define MXC_BASE_UART2 ((uint32_t)0x40044000UL)
#define MXC_UART2 ((mxc_uart_regs_t *)MXC_BASE_UART2)
#define MXC_BASE_UART3 ((uint32_t)0x40045000UL)
#define MXC_UART3 ((mxc_uart_regs_t *)MXC_BASE_UART3)
#define MXC_BASE_UART4 ((uint32_t)0x40023000UL)
#define MXC_UART4 ((mxc_uart_regs_t *)MXC_BASE_UART4)
#define MXC_BASE_UART5 ((uint32_t)0x40024000UL)
#define MXC_UART5 ((mxc_uart_regs_t *)MXC_BASE_UART5)

#define MXC_UART_GET_IRQ(i)             \
    (IRQn_Type)((i) == 0 ? UART0_IRQn : \
                (i) == 1 ? UART1_IRQn : \
                (i) == 2 ? UART2_IRQn : \
                (i) == 3 ? UART3_IRQn : \
                (i) == 4 ? UART4_IRQn : \
                (i) == 5 ? UART5_IRQn : \
                           0)

#define MXC_UART_GET_BASE(i)     \
    ((i) == 0 ? MXC_BASE_UART0 : \
     (i) == 1 ? MXC_BASE_UART1 : \
     (i) == 2 ? MXC_BASE_UART2 : \
     (i) == 3 ? MXC_BASE_UART3 : \
     (i) == 4 ? MXC_BASE_UART4 : \
     (i) == 5 ? MXC_BASE_UART5 : \
                0)

#define MXC_UART_GET_UART(i) \
    ((i) == 0 ? MXC_UART0 :  \
     (i) == 1 ? MXC_UART1 :  \
     (i) == 2 ? MXC_UART2 :  \
     (i) == 3 ? MXC_UART3 :  \
     (i) == 4 ? MXC_UART4 :  \
     (i) == 5 ? MXC_UART5 :  \
                0)

#define MXC_UART_GET_IDX(p) \
    ((p) == MXC_UART0 ? 0 : \
     (p) == MXC_UART1 ? 1 : \
     (p) == MXC_UART2 ? 2 : \
     (p) == MXC_UART3 ? 3 : \
     (p) == MXC_UART4 ? 4 : \
     (p) == MXC_UART5 ? 5 : \
                        -1)

/******************************************************************************/
/*                                                                        SPI */
#define MXC_SPI_INSTANCES (4)
#define MXC_SPI_SS_INSTANCES (4)
#define MXC_SPI_FIFO_DEPTH (32)

